---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateBaluster
source: html/8d5bfb0b-cc27-bcab-4eab-8865cd660781.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateBaluster Property

Can't create Balusters for given Width and Height.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateBaluster { get; }
```